In [1]:
import pandas as pd

In [35]:
df = pd.read_excel("the-number-of-public-transport-passengers-by-year-and-city_team2.xlsx")
df = df.drop([0,1,2,3,4])
df = df.drop('Unnamed: 0', axis=1)
row = df.iloc[0]#The iloc() method can be used to select rows and columns from a DataFrame by index label. 
col_mapp = {
    'Unnamed: 1': row.iloc[0],
    'Unnamed: 2': row.iloc[1],
    'Unnamed: 3': row.iloc[2],
    'Unnamed: 4': row.iloc[3],
    'Unnamed: 5': row.iloc[4],
    'Unnamed: 6': row.iloc[5],
    'Unnamed: 7': row.iloc[6],
    'Unnamed: 8': row.iloc[7]
}
df =df.set_axis(list(col_mapp.values()), axis=1)
df = df.drop(5)
df.head(5)

,المدينة,اجمالي عدد ركاب النقل العام خلال السنة(2016),اجمالي عدد ركاب النقل العام خلال السنة(2017),اجمالي عدد ركاب النقل العام خلال السنة(2018),اجمالي عدد ركاب النقل العام خلال السنة(2019),اجمالي عدد ركاب النقل العام خلال السنة(2020),اجمالي عدد ركاب النقل العام خلال السنة(2021),اجمالي عدد ركاب النقل العام خلال السنة(2022)
6,الرياض,1409890.5,1690540,5082110.928571,8142886,3911449,5813692,6017436
7,جدة,853839,1161330.5,2769925.944444,4033215,2287532,3992553,4401483
8,المدينة المنورة,1370139.9,1902893.8,1496747.079365,1287501,203355,0,287539
9,الدمام,650363,729328.5,444746.4,267401,73683.333333,0,54849

In [37]:
df1 = pd.read_csv("used_car_cleaned.csv")
df1.head(20)

,car_brand,car_model,car_driven,car_transmission,car_model_year,car_price
0,Hyundai,Tucson,83491.0,Automatic,2018,64000.0
1,Chevrolet,Trailblazer,222000.0,Automatic,2009,20000.0
2,Great,Wall,0.0,Automatic,2022,135000.0
3,Ford,Fusion,178000.0,Automatic,2012,23000.0
4,Mitsubishi,Attrage,10500.0,Automatic,2020,32000.0
5,Honda,HR-V,1000.0,Automatic,2021,80000.0
6,Hyundai,Accent,68000.0,Automatic,2016,24000.0
7,Ford,Explorer,49000.0,Automatic,2015,69000.0
8,Nissan,Sentra,149000.0,CVT,2014,23000.0
9,Ford,Explorer,49000.0,Automatic,2015,69000.0
10,Toyota,Yaris,118000.0,Automatic,2017,30000.0
11,Ford,Focus,280000.0,Automatic,2010,10500.0
12,MG,3,325889.0,Automatic,2008,13000.0
13,Toyota,Camry,410000.0,Automatic,2006,10000.0
14,Chevrolet,Cruze,200000.0,Manual,2010,12000.0
15,Dodge,Charger,389000.0,Automatic,2008,15500.0
16,Toyota,Camry,163000.0,Automatic,2017,60000.0
17,BMW,3,124000.0,Automatic,2014,64000.0
18,Kia,Cerato,1640000.0,Automatic,2012,33000.0
19,Toyota,Land,152000.0,Automatic,2011,63000.0

In [38]:
df2 = pd.read_csv("Population estimates by gender nationality and region 2010 - 2022_data.csv")
df2.head(20)

             Region   Year  Gender Nationality Population estimates
0           Madinah  2,014  Female       Saudi              562,344
1            Tabouk  2,010  Female       Saudi              239,792
2              Hail  2,013  Female       Saudi              211,727
3    Eastern Region  2,016    Male       Saudi            1,308,467
4           Al-Baha  2,018  Female   Non-Saudi               16,951
5   Northern Region  2,016  Female   Non-Saudi               21,111
6           Al-Jouf  2,013    Male       Saudi              181,436
7   Northern Region  2,019  Female   Non-Saudi               21,056
8           Madinah  2,013  Female       Saudi              546,260
9            Qaseem  2,021    Male       Saudi              451,061
10           Najran  2,012  Female       Saudi              156,915
11   Eastern Region  2,012  Female   Non-Saudi              347,508
12           Qaseem  2,017    Male   Non-Saudi              377,965
13          Madinah  2,018    Male       Saudi              613,235
14          Madinah  2,019    Male       Saudi              628,057
15          Al-Baha  2,019    Male   Non-Saudi               69,631
16           Riyadh  2,022  Female   Non-Saudi            1,012,243
17           Qaseem  2,022    Male       Saudi              461,032
18          Al-Jouf  2,011    Male       Saudi              173,361
19           Makkah  2,022    Male       Saudi            2,073,878

In [39]:
df = pd.read_csv("bus_ridership_New_York_City_Transit.csv")
df.head(20)

,Year,Average Weekday,Average Saturday,Average Sunday,Average Weekend,Annual Total
0,2016,2038119,1221299,957427,2178725,638413113
1,2017,1923993,1168978,923694,2092672,602620356
2,2018,1811605,1122626,868057,1990683,569361220
3,2019,1770394,1108809,847931,1956740,557036504
4,2020,980374,671835,532002,1203837,316768454
5,2021,984865,646302,482090,1128392,311893583